; domain
(define (domain satellite)
  (:requirements :typing :fluents :equality)
 (:types satellite direction instrument mode)
 (:predicates 
               (on_board ?i - instrument ?s - satellite)
	       (supports ?i - instrument ?m - mode)
	       (pointing ?s - satellite ?d - direction)
	       (power_avail ?s - satellite)
	       (power_on ?i - instrument)
	       (calibrated ?i - instrument)
	       (have_image ?d - direction ?m - mode)
	       (calibration_target ?i - instrument ?d - direction))
 
 

  (:functions (data_capacity ?s - satellite)
	      (data ?d - direction ?m - mode)
		(slew_time ?a ?b - direction)
		(data-stored)
		(fuel ?s - satellite)
		(fuel-used)
  )

  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev)
                   (not (= ?d_new ?d_prev))
		(>= (fuel ?s) (slew_time ?d_new ?d_prev))
              )
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))
		(decrease (fuel ?s) (slew_time ?d_new ?d_prev))
		(increase (fuel-used) (slew_time ?d_new ?d_prev))
           )
  )

 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
 
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s)
                 )
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))
           )
          
  )

 
  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
 
   :precondition (and (on_board ?i ?s)
                      (power_on ?i) 
                  )
   :effect (and (not (power_on ?i))
                (power_avail ?s)
           )
  )

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i)
                  )
   :effect (calibrated ?i)
  )
 

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d)
                      (power_on ?i)
			  (>= (data_capacity ?s) (data ?d ?m))
               )
   :effect (and (decrease (data_capacity ?s) (data ?d ?m)) (have_image ?d ?m)
		(increase (data-stored) (data ?d ?m)))
  )
)

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	satellite1 - satellite
	instrument2 - instrument
	satellite2 - satellite
	instrument3 - instrument
	instrument4 - instrument
	instrument5 - instrument
	image1 - mode
	image2 - mode
	thermograph3 - mode
	infrared0 - mode
	Star0 - direction
	Star2 - direction
	Star1 - direction
	Star3 - direction
	Phenomenon4 - direction
	Planet5 - direction
	Planet6 - direction
	Phenomenon7 - direction
	Planet8 - direction
)
(:init
	(supports instrument0 image1)
	(calibration_target instrument0 Star0)
	(supports instrument1 image2)
	(supports instrument1 infrared0)
	(supports instrument1 image1)
	(calibration_target instrument1 Star0)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Planet5)
	(= (data_capacity satellite0) 1000)
	(= (fuel satellite0) 107)
	(supports instrument2 infrared0)
	(supports instrument2 image2)
	(supports instrument2 image1)
	(calibration_target instrument2 Star0)
	(on_board instrument2 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Phenomenon7)
	(= (data_capacity satellite1) 1000)
	(= (fuel satellite1) 120)
	(supports instrument3 thermograph3)
	(supports instrument3 image1)
	(calibration_target instrument3 Star2)
	(supports instrument4 infrared0)
	(calibration_target instrument4 Star1)
	(supports instrument5 infrared0)
	(supports instrument5 thermograph3)
	(supports instrument5 image2)
	(calibration_target instrument5 Star1)
	(on_board instrument3 satellite2)
	(on_board instrument4 satellite2)
	(on_board instrument5 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Star2)
	(= (data_capacity satellite2) 1000)
	(= (fuel satellite2) 104)
	(= (data Star3 image1) 115)
	(= (data Phenomenon4 image1) 87)
	(= (data Planet5 image1) 151)
	(= (data Planet6 image1) 217)
	(= (data Phenomenon7 image1) 9)
	(= (data Planet8 image1) 274)
	(= (data Star3 image2) 108)
	(= (data Phenomenon4 image2) 52)
	(= (data Planet5 image2) 72)
	(= (data Planet6 image2) 282)
	(= (data Phenomenon7 image2) 105)
	(= (data Planet8 image2) 14)
	(= (data Star3 thermograph3) 108)
	(= (data Phenomenon4 thermograph3) 124)
	(= (data Planet5 thermograph3) 286)
	(= (data Planet6 thermograph3) 67)
	(= (data Phenomenon7 thermograph3) 256)
	(= (data Planet8 thermograph3) 271)
	(= (data Star3 infrared0) 41)
	(= (data Phenomenon4 infrared0) 44)
	(= (data Planet5 infrared0) 60)
	(= (data Planet6 infrared0) 284)
	(= (data Phenomenon7 infrared0) 240)
	(= (data Planet8 infrared0) 140)
	(= (slew_time Star2 Star0) 71.74)
	(= (slew_time Star0 Star2) 71.74)
	(= (slew_time Star2 Star1) 8.039)
	(= (slew_time Star1 Star2) 8.039)
	(= (slew_time Star1 Star0) 34.49)
	(= (slew_time Star0 Star1) 34.49)
	(= (slew_time Star3 Star0) 57.79)
	(= (slew_time Star0 Star3) 57.79)
	(= (slew_time Star3 Star1) 37)
	(= (slew_time Star1 Star3) 37)
	(= (slew_time Star3 Star2) 39.87)
	(= (slew_time Star2 Star3) 39.87)
	(= (slew_time Phenomenon4 Star0) 17)
	(= (slew_time Star0 Phenomenon4) 17)
	(= (slew_time Phenomenon4 Star1) 2.97)
	(= (slew_time Star1 Phenomenon4) 2.97)
	(= (slew_time Phenomenon4 Star2) 4.109)
	(= (slew_time Star2 Phenomenon4) 4.109)
	(= (slew_time Phenomenon4 Star3) 77.26)
	(= (slew_time Star3 Phenomenon4) 77.26)
	(= (slew_time Planet5 Star0) 68.26)
	(= (slew_time Star0 Planet5) 68.26)
	(= (slew_time Planet5 Star1) 59.15)
	(= (slew_time Star1 Planet5) 59.15)
	(= (slew_time Planet5 Star2) 56.2)
	(= (slew_time Star2 Planet5) 56.2)
	(= (slew_time Planet5 Star3) 19.9)
	(= (slew_time Star3 Planet5) 19.9)
	(= (slew_time Planet5 Phenomenon4) 36.52)
	(= (slew_time Phenomenon4 Planet5) 36.52)
	(= (slew_time Planet6 Star0) 18.01)
	(= (slew_time Star0 Planet6) 18.01)
	(= (slew_time Planet6 Star1) 34.89)
	(= (slew_time Star1 Planet6) 34.89)
	(= (slew_time Planet6 Star2) 28.83)
	(= (slew_time Star2 Planet6) 28.83)
	(= (slew_time Planet6 Star3) 38.03)
	(= (slew_time Star3 Planet6) 38.03)
	(= (slew_time Planet6 Phenomenon4) 12.33)
	(= (slew_time Phenomenon4 Planet6) 12.33)
	(= (slew_time Planet6 Planet5) 77.02)
	(= (slew_time Planet5 Planet6) 77.02)
	(= (slew_time Phenomenon7 Star0) 15.4)
	(= (slew_time Star0 Phenomenon7) 15.4)
	(= (slew_time Phenomenon7 Star1) 16.64)
	(= (slew_time Star1 Phenomenon7) 16.64)
	(= (slew_time Phenomenon7 Star2) 19.88)
	(= (slew_time Star2 Phenomenon7) 19.88)
	(= (slew_time Phenomenon7 Star3) 66.58)
	(= (slew_time Star3 Phenomenon7) 66.58)
	(= (slew_time Phenomenon7 Phenomenon4) 53.4)
	(= (slew_time Phenomenon4 Phenomenon7) 53.4)
	(= (slew_time Phenomenon7 Planet5) 62.12)
	(= (slew_time Planet5 Phenomenon7) 62.12)
	(= (slew_time Phenomenon7 Planet6) 5.202)
	(= (slew_time Planet6 Phenomenon7) 5.202)
	(= (slew_time Planet8 Star0) 56.19)
	(= (slew_time Star0 Planet8) 56.19)
	(= (slew_time Planet8 Star1) 8.556)
	(= (slew_time Star1 Planet8) 8.556)
	(= (slew_time Planet8 Star2) 35.71)
	(= (slew_time Star2 Planet8) 35.71)
	(= (slew_time Planet8 Star3) 43.41)
	(= (slew_time Star3 Planet8) 43.41)
	(= (slew_time Planet8 Phenomenon4) 56.35)
	(= (slew_time Phenomenon4 Planet8) 56.35)
	(= (slew_time Planet8 Planet5) 15.55)
	(= (slew_time Planet5 Planet8) 15.55)
	(= (slew_time Planet8 Planet6) 96.45)
	(= (slew_time Planet6 Planet8) 96.45)
	(= (slew_time Planet8 Phenomenon7) 66.58)
	(= (slew_time Phenomenon7 Planet8) 66.58)
	(= (data-stored) 0)
	(= (fuel-used) 0)
)
(:goal (and
	(pointing satellite2 Planet5)
	(have_image Star3 thermograph3)
	(have_image Planet5 image1)
	(have_image Planet6 thermograph3)
	(have_image Phenomenon7 thermograph3)
	(have_image Planet8 image2)
))
(:metric minimize (fuel-used))

)

; plan
1. (turn_to satellite2 phenomenon4 star2)
   deleted: (pointing satellite2 star2)
   added: (pointing satellite2 phenomenon4)
   changed: (fuel satellite2) from 104 to 99.891, (fuel-used) from 0 to 4.109
   goals met: 0 of 6
2. (switch_on instrument3 satellite2)
   deleted: (power_avail satellite2)
   added: (power_on instrument3)
   goals met: 0 of 6
3. (turn_to satellite2 star2 phenomenon4)
   deleted: (pointing satellite2 phenomenon4)
   added: (pointing satellite2 star2)
   changed: (fuel satellite2) from 99.891 to 95.782, (fuel-used) from 4.109 to 8.218
   goals met: 0 of 6
4. (calibrate satellite2 instrument3 star2)
   added: (calibrated instrument3)
   goals met: 0 of 6
5. (turn_to satellite2 star1 star2)
   deleted: (pointing satellite2 star2)
   added: (pointing satellite2 star1)
   changed: (fuel satellite2) from 95.782 to 87.743, (fuel-used) from 8.218 to 16.257
   goals met: 0 of 6
6. (turn_to satellite2 phenomenon7 star1)
   deleted: (pointing satellite2 star1)
   added: (pointing satellite2 phenomenon7)
   changed: (fuel satellite2) from 87.743 to 71.103, (fuel-used) from 16.257 to 32.897
   goals met: 0 of 6
7. (take_image satellite2 phenomenon7 instrument3 thermograph3)
   added: (have_image phenomenon7 thermograph3)
   changed: (data_capacity satellite2) from 1000 to 744, (data-stored) from 0 to 256
   goals met: 1 of 6
8. (turn_to satellite2 planet6 phenomenon7)
   deleted: (pointing satellite2 phenomenon7)
   added: (pointing satellite2 planet6)
   changed: (fuel satellite2) from 71.103 to 65.901, (fuel-used) from 32.897 to 38.099
   goals met: 1 of 6
9. (take_image satellite2 planet6 instrument3 thermograph3)
   added: (have_image planet6 thermograph3)
   changed: (data_capacity satellite2) from 744 to 677, (data-stored) from 256 to 323
   goals met: 2 of 6
10. (turn_to satellite2 star3 planet6)
   deleted: (pointing satellite2 planet6)
   added: (pointing satellite2 star3)
   changed: (fuel satellite2) from 65.901 to 27.871, (fuel-used) from 38.099 to 76.129
   goals met: 2 of 6
11. (turn_to satellite1 star0 phenomenon7)
   deleted: (pointing satellite1 phenomenon7)
   added: (pointing satellite1 star0)
   changed: (fuel satellite1) from 120 to 104.6, (fuel-used) from 76.129 to 91.529
   goals met: 2 of 6
12. (take_image satellite2 star3 instrument3 thermograph3)
   added: (have_image star3 thermograph3)
   changed: (data_capacity satellite2) from 677 to 569, (data-stored) from 323 to 431
   goals met: 3 of 6
13. (turn_to satellite2 planet5 star3)
   deleted: (pointing satellite2 star3)
   added: (pointing satellite2 planet5)
   changed: (fuel satellite2) from 27.871 to 7.971, (fuel-used) from 91.529 to 111.429
   goals met: 4 of 6
14. (turn_to satellite1 phenomenon4 star0)
   deleted: (pointing satellite1 star0)
   added: (pointing satellite1 phenomenon4)
   changed: (fuel satellite1) from 104.6 to 87.6, (fuel-used) from 111.429 to 128.429
   goals met: 4 of 6
15. (turn_to satellite1 star1 phenomenon4)
   deleted: (pointing satellite1 phenomenon4)
   added: (pointing satellite1 star1)
   changed: (fuel satellite1) from 87.6 to 84.63, (fuel-used) from 128.429 to 131.399
   goals met: 4 of 6
16. (turn_to satellite1 phenomenon4 star1)
   deleted: (pointing satellite1 star1)
   added: (pointing satellite1 phenomenon4)
   changed: (fuel satellite1) from 84.63 to 81.66, (fuel-used) from 131.399 to 134.369
   goals met: 4 of 6
17. (take_image satellite2 planet5 instrument3 image1)
   added: (have_image planet5 image1)
   changed: (data_capacity satellite2) from 569 to 418, (data-stored) from 431 to 582
   goals met: 5 of 6
18. (turn_to satellite1 star1 phenomenon4)
   deleted: (pointing satellite1 phenomenon4)
   added: (pointing satellite1 star1)
   changed: (fuel satellite1) from 81.66 to 78.69, (fuel-used) from 134.369 to 137.339
   goals met: 5 of 6
19. (turn_to satellite1 phenomenon4 star1)
   deleted: (pointing satellite1 star1)
   added: (pointing satellite1 phenomenon4)
   changed: (fuel satellite1) from 78.69 to 75.72, (fuel-used) from 137.339 to 140.309
   goals met: 5 of 6
20. (switch_on instrument2 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument2)
   goals met: 5 of 6
21. (turn_to satellite1 star1 phenomenon4)
   deleted: (pointing satellite1 phenomenon4)
   added: (pointing satellite1 star1)
   changed: (fuel satellite1) from 75.72 to 72.75, (fuel-used) from 140.309 to 143.279
   goals met: 5 of 6
22. (turn_to satellite1 phenomenon4 star1)
   deleted: (pointing satellite1 star1)
   added: (pointing satellite1 phenomenon4)
   changed: (fuel satellite1) from 72.75 to 69.78, (fuel-used) from 143.279 to 146.249
   goals met: 5 of 6
23. (turn_to satellite1 star0 phenomenon4)
   deleted: (pointing satellite1 phenomenon4)
   added: (pointing satellite1 star0)
   changed: (fuel satellite1) from 69.78 to 52.78, (fuel-used) from 146.249 to 163.249
   goals met: 5 of 6
24. (calibrate satellite1 instrument2 star0)
   added: (calibrated instrument2)
   goals met: 5 of 6
25. (turn_to satellite1 star1 star0)
   deleted: (pointing satellite1 star0)
   added: (pointing satellite1 star1)
   changed: (fuel satellite1) from 52.78 to 18.29, (fuel-used) from 163.249 to 197.739
   goals met: 5 of 6
26. (turn_to satellite1 planet8 star1)
   deleted: (pointing satellite1 star1)
   added: (pointing satellite1 planet8)
   changed: (fuel satellite1) from 18.29 to 9.734, (fuel-used) from 197.739 to 206.295
   goals met: 5 of 6
27. (take_image satellite1 planet8 instrument2 image2)
   added: (have_image planet8 image2)
   changed: (data_capacity satellite1) from 1000 to 986, (data-stored) from 582 to 596
   goals met: 6 of 6
